/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) Leonard.  2020. All rights reserved.               */
/*                                                                            */
/* 文件名称: Fn_mvsprintf.c                                                   */
/* 内容摘要: 自定义打印函数实现源文件                                        */
/* 其它说明: 无                                                               */
/* 当前版本: v 1.0.0                                                          */
/* 作    者: Leonard                                                          */
/* 完成日期: 2020-11-20                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号     修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2020-11-20        v 1.0.0     Leonard         创建文件                 */
/*<FH->************************************************************************/

/******************************************************************************/
/*               #include(依次为标准库头文件、非标准库头文件)                */
/******************************************************************************/
#include <string.h>
#include "Fn_mctype.h"
#include "Fn_format.h"
#include "Fn_mvsprintf.h"

/******************************************************************************/
/*                                外部引用声明                                */
/******************************************************************************/
extern void bsp_console_puts(const char *str);

/******************************************************************************/
/*                                 内部宏定义                                 */
/******************************************************************************/
#define PRINT_BUF_MAX_SIZE           (256)                   /* 打印缓存长度 */

/******************************************************************************/
/*                              内部数据类型定义                              */
/******************************************************************************/


/******************************************************************************/
/*                                内部函数原型                                */
/******************************************************************************/
static int mvsnprintf(char *buf, unsigned int size, const char *fmt, va_list args);

/******************************************************************************/
/*                               全局(静态)变量                               */
/******************************************************************************/


/******************************************************************************/
/*                                内部函数实现                                */
/******************************************************************************/


/******************************************************************************/
/*                                全局函数实现                                */
/******************************************************************************/
/*<FUNC+>**********************************************************************/
/* 函数名称: mvsnprintf                                                       */
/* 功能描述: 将格式化字符串输出到指定大小的缓冲区                            */
/* 输入参数: buf  --- 指向缓冲区的指针                                        */
/*           size --- 缓冲区的大小                                            */
/*           fmt  --- 格式化字符串                                            */
/*           args --- 参数列表                                                */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 格式化字符串的格式如下:                                         */
/*           <%> [标志] [输出最小宽度] [长度] <类型>                         */
/*                                                                            */
/*           支持的标志如下:                                                  */
/*           -      左对齐,以空格填充右侧剩余输出宽度                        */
/*           +      输出符号(正号或负号)                                     */
/*           0      右对齐,以'0'填充左侧剩余输出宽度                         */
/*                                                                            */
/*           支持的长度:                                                      */
/*           h      按短整型量输出                                            */
/*           l      按长整型量输出                                            */
/*                                                                            */
/*           支持的类型                                                       */
/*           c      输出单个字符                                              */
/*           s      输出字符串                                                */
/*           p      输出指针                                                  */
/*           o      以八进制形式输出无符号整数(不输出前缀o)                  */
/*           x,X    以十六进制形式输出无符号整数(不输出前缀0x)               */
/*           d,i    以十进制形式输出带符号整数(正数不输出符号)               */
/*           u      以十进制形式输出无符号整数                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2020-11-20              v 1.0.0       Leonard       创建函数           */
/*<FUNC->**********************************************************************/
static int mvsnprintf(char *buf, unsigned int size, const char *fmt, va_list args)
{
    int len;                        /* 要打印字符串的长度                    */
    const char *s;                  /* 指向字符串参数的指针                  */
    char c;                         /* 字符参数                               */
    unsigned long long num;         /* 整数参数                               */
    char *str;
    char *end;
    int i;
    int base;                       /* 进制                                   */
    int flags;                      /* flags to Fn_ValToStr_Strict()          */
    int field_width;                /* width of output field                  */
    int qualifier;                  /* 'h', 'l', or 'L' for integer fields    */

    /**************************************************************************/
    /* 确定解析格式化字符串的起始地址                                        */
    /**************************************************************************/
    str = buf;
    end = buf + size - 1;

    /**************************************************************************/
    /* 逐一字符解析格式化字符串,直到遇到字符串结束符'\0'                     */
    /**************************************************************************/
    for (; *fmt != '\0'; ++fmt)
    {
        /**********************************************************************/
        /* %之前的字符直接保存到缓冲区                                       */
        /**********************************************************************/
        if (*fmt != '%')
        {
            if (str <= end)
            {
                *str = *fmt;
            }

            ++str;
            continue;
        }

        /**********************************************************************/
        /* 处理标志; 支持左/右对齐,是否输出+/-符号,扩展支持补'0'/' '        */
        /**********************************************************************/
        flags = 0;

        while (1)
        {
            ++fmt;                       /* 跳过'%' */

            if ('-' == *fmt)
            {
                flags |= LEFT;           /* 默认右对齐 */
            }
            else if ('+' == *fmt)
            {
                flags |= PLUS;           /* 默认不显示'+' */
            }
            else if ('0' == *fmt)
            {
                flags |= ZEROPAD;        /* 默认' '补位 */
            }
            else
            {
                break;
            }
        }

        /**********************************************************************/
        /* 处理输出最小宽度                                                   */
        /**********************************************************************/
        field_width = -1;

        if (isdigit(*fmt))
        {
            field_width = Fn_atoi(&fmt);
        }
        else if ('*' == *fmt)
        {
            ++fmt;

            field_width = va_arg(args, int);

            if (field_width < 0)
            {
                field_width = -field_width;
                flags |= LEFT;
            }
        }

        /**********************************************************************/
        /* 处理长度格式符                                                     */
        /**********************************************************************/
        qualifier = -1;

        if (*fmt == 'h' || *fmt == 'l' || *fmt == 'L')
        {
            qualifier = *fmt;
            ++fmt;

            if (qualifier == 'l' && *fmt == 'l')
            {
                qualifier = 'L';
                ++fmt;
            }
        }

        /**********************************************************************/
        /* 处理进制类型                                                       */
        /**********************************************************************/
        base = 10;

        switch (*fmt)
        {
        /******************************************************************/
        /* 字符类型的处理                                                 */
        /******************************************************************/
        case 'c':
            if (!(flags & LEFT))                    /* 不是左对齐,补空格 */
            {
                while (--field_width > 0)
                {
                    if (str <= end)
                    {
                        *str = ' ';
                    }
                    ++str;
                }
            }

            c = (unsigned char)va_arg(args, int);   /* 获取字符参数       */

            if (str <= end)                         /* 保存字符           */
            {
                *str = c;
            }

            ++str;

            while (--field_width > 0)
            {
                if (str <= end)
                {
                    *str = ' ';
                }
                ++str;
            }

            continue;

        /******************************************************************/
        /* 字符串类型的处理                                               */
        /******************************************************************/
        case 's':
            s = va_arg(args, char *);           /* 获取指向字符串的指针   */

            if ((unsigned long long)s < 1024)
            {
                s = "<NULL>";
            }

            len = strlen(s);                    /* 获取字符串长度         */

            if (!(flags & LEFT))                /* 不是左对齐,补空格     */
            {
                while (len < field_width--)
                {
                    if (str <= end)
                    {
                        *str = ' ';
                    }

                    ++str;
                }
            }

            for (i = 0; i < len; ++i)           /* 填写字符串             */
            {
                if (str <= end)
                {
                    *str = *s;
                }

                ++str;
                ++s;
            }

            while (len < field_width--)
            {
                if (str <= end)
                {
                    *str = ' ';
                }

                ++str;
            }

            continue;

        /******************************************************************/
        /* 指针类型的处理                                                 */
        /******************************************************************/
        case 'p':
            if (field_width == -1)
            {
                field_width = 2 * sizeof(void *);
                flags |= ZEROPAD;
            }

            str = Fn_ValToStr_Strict(str, end, (unsigned long long)va_arg(args, void *), 16, field_width, flags);
            continue;

        /******************************************************************/
        /* %类型的处理                                                    */
        /******************************************************************/
        case '%':
            if (str <= end)
            {
                *str = '%';
            }

            ++str;
            continue;

        /******************************************************************/
        /* 八进制形式输出无符号整数(不输出前缀0)的 处理               */
        /******************************************************************/
        case 'o':
            base = 8;
            break;

        /******************************************************************/
        /* 以16进制形式输出无符号整数(不输出前缀0x)的处理             */
        /******************************************************************/
        case 'X':
        case 'x':
            base = 16;
            break;

        /******************************************************************/
        /* 有符号十进制整数的处理                                        */
        /******************************************************************/
        case 'd':
        case 'i':
            flags |= SIGN;
        case 'u':
            break;

        /******************************************************************/
        /* 不支持的类型,原样输出                                         */
        /******************************************************************/
        default:
            if (str <= end)
            {
                *str = '%';
            }

            ++str;

            if (*fmt)
            {
                if (str <= end)
                {
                    *str = *fmt;
                }

                ++str;
            }
            else
            {
                --fmt;                      /* for语句是++,所以这里-- */
            }

            continue;
        }

        if (qualifier == 'L')
        {
            num = va_arg(args, long long);
        }
        else if (qualifier == 'l')
        {
            num = va_arg(args, unsigned long);

            if (flags & SIGN)
            {
                num = (signed long)num;
            }
        }
        else if (qualifier == 'h')
        {
            num = (unsigned short) va_arg(args, int);

            if (flags & SIGN)
            {
                num = (signed short) num;
            }
        }
        else
        {
            num = va_arg(args, unsigned int);

            if (flags & SIGN)
            {
                num = (signed int)num;
            }
        }

        str = Fn_ValToStr_Strict(str, end, num, base, field_width, flags);
    }

    /**************************************************************************/
    /* 添加字符串结束符,区分缓冲区未满和满的情况;size为0时,不会添加结束符   */
    /**************************************************************************/
    if (str <= end)
    {
        *str = '\0';
    }
    else if (size > 0)
    {
        *end = '\0';    /* 缓存区满,超长的截断丢弃 */
    }

    /**************************************************************************/
    /* 字符串结束符没有计入解析后的字符串的总长度                            */
    /**************************************************************************/
    return (str - buf);
}

/*<FUNC+>**********************************************************************/
/* 函数名称: msnprintf                                                        */
/* 功能描述: 将格式化字符串输出到指定缓冲区                                  */
/* 输入参数: buf --- 指向缓冲区的指针                                         */
/*           size --- 缓冲区大小                                              */
/*           fmt --- 格式化字符串                                             */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2020-11-20              v 1.0.0       Leonard       创建函数           */
/*<FUNC->**********************************************************************/
int msnprintf(char *buf, unsigned int size, const char *fmt, ...)
{
    va_list args;
    int i;

    va_start(args, fmt);
    i = mvsnprintf(buf, size, fmt, args);
    va_end(args);

    return i;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: mvsprintf                                                        */
/* 功能描述: 将格式化字符串输出到指定缓冲区                                  */
/* 输入参数: buf  --- 指向缓冲区的指针                                        */
/*           fmt  --- 格式化字符串                                            */
/*           args --- 参数列表                                                */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2020-11-20              v 1.0.0       Leonard       创建函数           */
/*<FUNC->**********************************************************************/
int mvsprintf(char *buf, const char *fmt, va_list args)
{
    return mvsnprintf(buf, (~0U) >> 1, fmt, args);
}

/*<FUNC+>**********************************************************************/
/* 函数名称: msprintf                                                         */
/* 功能描述: 将格式化字符串打印到缓冲区(可变参数)                            */
/* 输入参数: buf --- 指向缓冲区的指针                                         */
/*           fmt --- 格式化字符串                                             */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2020-11-20              v 1.0.0       Leonard       创建函数           */
/*<FUNC->**********************************************************************/
int msprintf(char *buf, const char *fmt, ...)
{
    va_list args;
    int i;

    va_start(args, fmt);
    i = mvsprintf(buf, fmt, args);
    va_end(args);

    return i;
}

/*<FUNC+>**********************************************************************/
/* 函数名称: mprintf                                                          */
/* 功能描述: 打印函数的实现                                                   */
/* 输入参数: fmt --- 格式化字符串                                             */
/* 输入参数: 无                                                               */
/* 输出参数: 无                                                               */
/* 返 回 值: int                                                              */
/* 操作流程:                                                                  */
/* 其它说明: 无                                                               */
/* 修改记录:                                                                  */
/* -------------------------------------------------------------------------- */
/*     2020-11-19              v 1.0.0       Leonard       创建函数           */
/*<FUNC->**********************************************************************/
int mprintf(const char *fmt, ...)
{
    va_list args;
    int  len;
    char printbuffer[PRINT_BUF_MAX_SIZE];

    va_start(args, fmt);
    
    len = mvsnprintf(printbuffer, sizeof(printbuffer), fmt, args);
    bsp_console_puts(printbuffer);
    
    va_end(args);
        
    return len;
}

int mvprintf(const char *fmt, va_list args)
{
    int  len;
    char printbuffer[PRINT_BUF_MAX_SIZE];

    len = mvsnprintf(printbuffer, sizeof(printbuffer), fmt, args);
    bsp_console_puts(printbuffer);
    
    return len;
}

int mfprintf(int file, const char *fmt, ...)
{
    va_list args;
    unsigned int i;
    char printbuffer[PRINT_BUF_MAX_SIZE];

    va_start(args, fmt);
    /* 要使其正常工作,printbuffer必须大于我们要打印的任何内容 */
    i = mvsnprintf(printbuffer, sizeof(printbuffer), fmt, args);
    va_end(args);

    //fputs(file, printbuffer);  /* 发送到所需文件 */
    return i;
}

