/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 烽鸟出行. 2019. All rights reserved.               */
/*                                                                            */
/* 文件名称: Fn_mctype.h                                                      */
/* 内容摘要: 标准定义头文件                                                   */
/* 其它说明: 无                                                               */
/* 当前版本: v 1.0.0                                                          */
/* 作    者: Leonard                                                          */
/* 完成日期: 2020-11-20                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号     修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2020-11-20        v 1.0.0     Leonard         创建文件                 */
/*<FH->************************************************************************/
#ifndef FN_MCTYPE_H
#define FN_MCTYPE_H

/******************************************************************************/
/*               #include(依次为标准库头文件、非标准库头文件)                */
/******************************************************************************/


/******************************************************************************/
/*                              其他条件编译选项                              */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                                  常量定义                                  */
/******************************************************************************/


/******************************************************************************/
/*                                 全局宏定义                                 */
/******************************************************************************/
/******************************************************************************/
/* ASCII码的控制字符                                                          */
/******************************************************************************/
#define ASCII_NUL         0x00        /* 空字符(NULL, \0, ^@ = Ctrl+@)        */     
#define ASCII_SOH         0x01        /* 标题开始(^A) start 128B data packet  */
#define ASCII_STX         0x02        /* 本文开始(^B) start 1024B data packet */
#define ASCII_ETX         0x03        /* 本文结束(^C)                         */
#define ASCII_EOT         0x04        /* 传输结束(^D)                         */
#define ASCII_ENQ         0x05        /* 查询/请求(^E)                        */
#define ASCII_ACK         0x06        /* 接收正确回应(^F)                     */
#define ASCII_BEL         0x07        /* 响铃(^G, \a)                         */
#define ASCII_BS          0x08        /* 退格(^H, \b) backspace               */
#define ASCII_HT          0x09        /* 水平定位符号(^I, \t)                 */
#define ASCII_LF          0x0A        /* 换行符(^J, \n)                       */
#define ASCII_VT          0x0B        /* 垂直定位符号(^K, \v)                 */
#define ASCII_FF          0x0C        /* 换页符(^L, \f)                       */
#define ASCII_CR          0x0D        /* 归位符(^M, \r)                       */
#define ASCII_SO          0x0E        /* 取消变换(Shift out)(^N)              */
#define ASCII_SI          0x0F        /* 启用变换(Shift in)(^O)               */
#define ASCII_DLE         0x10        /* 跳出数据通信(^P)                     */
#define ASCII_DC1         0x11        /* 设备控制1(XON启用软件速度控制)(^Q)  */
#define ASCII_DC2         0x12        /* 设备控制2(^R)                        */
#define ASCII_DC3         0x13        /* 设备控制3(XON停用软件速度控制)(^S)  */
#define ASCII_DC4         0x14        /* 设备控制4(^T)                        */
#define ASCII_NAK         0x15        /* 接收错误回应(^U) retry               */
#define ASCII_SYN         0x16        /* 同步用暂停(^V)                       */
#define ASCII_ETB         0x17        /* 区块传输结束(^W)                     */
#define ASCII_CAN         0x18        /* 取消(^X),2个CAN终止传输              */
#define ASCII_EM          0x19        /* 连接介质中断(^Y)                     */
#define ASCII_SUB         0x1A        /* 替换(^Z for DOS officionados)        */
#define ASCII_ESC         0x1B        /* 跳出(^[, \e)                         */
#define ASCII_FS          0x1C        /* 文件分割符(^\)                       */
#define ASCII_GS          0x1D        /* 组群分割符(^])                       */
#define ASCII_RS          0x1E        /* 记录分割符(^^)                       */
#define ASCII_US          0x1F        /* 单元分割符(^-)                       */
#define ASCII_DEL         0x7F        /* 删除(^Backspace)                     */

/******************************************************************************/
/* ASCII码的分类标识                                                          */
/******************************************************************************/
#define _U                0x01        /* upper / 大写符号                    */
#define _L                0x02        /* lower / 小写符号                    */
#define _D                0x04        /* digit / 数字符号                    */
#define _C                0x08        /* cntrl / 控制符号                    */
#define _P                0x10        /* punct / 标点符号                    */
#define _S                0x20        /* white space(space/lf/tab)/空白符号  */
#define _X                0x40        /* hex digit / 16进制符号              */
#define _SP               0x80        /* hard space (0x20) / 空格符          */

/******************************************************************************/
/* 判断ASCII码的类型                                                          */
/******************************************************************************/
#define __ismask(x)      (_mctype[(int)(unsigned char)(x)])

#define isalnum(c)       ((__ismask(c)&(_U|_L|_D)) != 0)        /* 是否为数字/字母符号 '0'~'9'/'a'~'z'/'A'~'Z' */
#define isalpha(c)       ((__ismask(c)&(_U|_L)) != 0)           /* 是否为字母符号 'a'~'z'/'A'~'Z' */
#define iscntrl(c)       ((__ismask(c)&(_C)) != 0)              /* 是否为控制符号 [0,31],127 */
#define isdigit(c)       ((__ismask(c)&(_D)) != 0)              /* 是否为数字符号 '0'~'9' */
#define isgraph(c)       ((__ismask(c)&(_P|_U|_L|_D)) != 0)     /* 是否为可显示符号 '!'~'~' [33, 126] */
#define islower(c)       ((__ismask(c)&(_L)) != 0)              /* 是否为小写字母 'a'~'z' */
#define isprint(c)       ((__ismask(c)&(_P|_U|_L|_D|_SP)) != 0) /* 是否为可打印符号 ' '~'~' [32, 126] */
#define ispunct(c)       ((__ismask(c)&(_P)) != 0)              /* 是否为标点符号 */
#define isspace(c)       ((__ismask(c)&(_S)) != 0)              /* 是否为制表符号 */
#define isupper(c)       ((__ismask(c)&(_U)) != 0)              /* 是否为大写字母 'A'~'Z' */
#define isxdigit(c)      ((__ismask(c)&(_D|_X)) != 0)           /* 是否为16进制符号 '0'~'9'/'A'~'F'/'a'~'f' */

#define isblank(c)       (c == ' ' || c == '\t')                 /* 是否为空白符号 ' '/'\t' */
#define isascii(c)       (((unsigned char)(c)) <= 0x7f)         /* 是否为ascii符号 */
#define toascii(c)       (((unsigned char)(c)) & 0x7f)          /* 强转为ascii符号 */

#ifndef NULL
#ifdef __cplusplus
#define NULL              0
#else
#define NULL             ((void *)0)
#endif
#endif

/******************************************************************************/
/*                              全局数据类型定义                              */
/******************************************************************************/


/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/
extern const unsigned char _mctype[];

/******************************************************************************/
/*                                 全局函数原型                               */
/******************************************************************************/


#ifdef __cplusplus
}
#endif

#endif


