/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 烽鸟出行. 2019. All rights reserved.               */
/*                                                                            */
/* 文件名称: Fn_splitdata.h                                                   */
/* 内容摘要: 合分包处理头文件                                                 */
/* 其它说明: 无                                                               */
/* 当前版本: v 1.0.0                                                          */
/* 作    者: Leonard                                                          */
/* 完成日期: 2020-04-13                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号     修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2020-04-13        v 1.0.0     Leonard         创建文件                 */
/*<FH->************************************************************************/
#ifndef FN_SPLITDATA_H
#define FN_SPLITDATA_H

/******************************************************************************/
/*               #include(依次为标准库头文件、非标准库头文件)                */
/******************************************************************************/


/******************************************************************************/
/*                              其他条件编译选项                              */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                                  常量定义                                  */
/******************************************************************************/


/******************************************************************************/
/*                                 全局宏定义                                 */
/******************************************************************************/
#define SPLIT_HEAD_MAX      4                         /* 粘包帧头的最大长度 */
#define SPLIT_LENGTH_MAX   1536                       /* 粘包数据的最大长度 */

/******************************************************************************/
/*                              全局数据类型定义                             */
/******************************************************************************/
/******************************************************************************/
/* 粘包处理回调函数                                                          */
/******************************************************************************/
typedef void (*SPLIT_CB_FUN)(int way, unsigned char *pData, int iSize, int bUrgent);

/*<ENUM+>**********************************************************************/
/* 枚举: T_RANK_DATA                                                          */
/* 注释: 大端序/小端序                                                       */
/*<ENUM->**********************************************************************/
typedef enum  t_rank_data
{
    littleEN = 0,        /* 小端序  */
    bigEN = 1,           /* 大端序  */
} t_rank;

/*<STRUCT+>********************************************************************/
/* 结构: T_SPLIT_LENGTH                                                       */
/* 注释: 合分包中的长度信息                                                  */
/*<STRUCT->********************************************************************/
typedef struct t_split_length
{
    unsigned char        length_location;          /* 协议中长度信息所在位置  */
    unsigned char        length_count;             /* 长度占用字节数          */
    unsigned char        length_type;              /* 大端序/小端序           */
    unsigned char        length_mini_effe;         /* 指令最小有效长度        */
} T_SPLIT_L;

/*<STRUCT+>********************************************************************/
/* 结构: T_SPLIT_DATA_CB                                                      */
/* 注释: 合分包数据结构体                                                    */
/*<STRUCT->********************************************************************/
typedef struct t_split_data_cb
{
    unsigned char        header[SPLIT_HEAD_MAX];    /* 缓存帧头信息            */
    unsigned char        header_length;             /* 缓存帧头长度            */
    T_SPLIT_L            length;                    /* 合分包长度信息          */
    unsigned char       *pBuf;                      /* 合分包内已缓存数据      */
    unsigned short       iBufCompSize;              /* 合分包内已缓存数据长度  */
    unsigned short       iBufSize_max;              /* 支持最大处理数据长度    */
    SPLIT_CB_FUN         fnCallback;                /* 完整包数据回调处理函数  */
} T_SPLITDATA;

/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/
extern T_SPLITDATA   g_tSplitData;
extern unsigned char g_tSplitBuf[SPLIT_LENGTH_MAX];

/******************************************************************************/
/*                                 全局函数原型                               */
/******************************************************************************/
void Fn_SplitData_Test(void);
void Fn_SplitData_Handle(T_SPLITDATA *DataStruct, const unsigned char *pRcvData, int iRcvSize, int bUrgent);
T_SPLITDATA Fn_SplitData_TerminalRegister(unsigned char *pBuf, unsigned short iBufSize,
        unsigned char *iheader, unsigned char ihearder_length,
        unsigned char  ilength_location, unsigned char ilength_count,
        unsigned char  ilength_mini_effe, SPLIT_CB_FUN iFunCB);


#ifdef __cplusplus
}
#endif

#endif


