/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 烽鸟出行. 2019. All rights reserved.               */
/*                                                                            */
/* 文件名称: bsp_time.h                                                       */
/* 内容摘要: 硬件定时器头文件                                                */
/* 其它说明: 无                                                               */
/* 当前版本: v 1.0.0                                                          */
/* 作    者: Leonard                                                          */
/* 完成日期: 2020-11-19                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号     修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2020-11-19        v 1.0.0     Leonard         创建文件                 */
/*<FH->************************************************************************/
#ifndef BSP_TIME_H
#define BSP_TIME_H

/******************************************************************************/
/*               #include(依次为标准库头文件、非标准库头文件)                */
/******************************************************************************/
#include "stm32f4xx.h"
#include "Fn_device.h"

/******************************************************************************/
/*                              其他条件编译选项                              */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                                  常量定义                                  */
/******************************************************************************/


/******************************************************************************/
/*                                 全局宏定义                                 */
/******************************************************************************/
//#define BSP_USE_TIM1
//#define BSP_USE_TIM2
#define BSP_USE_TIM3

#define BSP_TIM_NEW_CYCLE       0x01              /* 设备操作码之新周期值   */

/******************************************************************************/
/*                              全局数据类型定义                              */
/******************************************************************************/
#pragma pack(1)

/*<STRUCT+>********************************************************************/
/* 结构: _TIM_DEV_CFG                                                         */
/* 注释: TIM定时器配置参数                                                   */
/*<STRUCT->********************************************************************/
struct _tim_dev_cfg
{
    unsigned int         prescaler;                /* 定时器预分频系数       */
    unsigned int         countmode;                /* 定时器计数模式         */
    unsigned int         period;                   /* 定时器自动重装载值     */
    unsigned int         clockdiv;                 /* 定时器时钟分频因子     */
    unsigned int         repetcount;               /* 定时器重复计数         */
    unsigned int         autoreload;               /* 定时器自动重加载       */
};
typedef struct _tim_dev_cfg *tim_dev_cfg_t;

/*<STRUCT+>********************************************************************/
/* 结构: _TIM_DEV_HAL                                                         */
/* 注释: TIM定时器HAL库句柄                                                  */
/*<STRUCT->********************************************************************/
struct _tim_dev_hal
{
    TIM_TypeDef         *timx;                     /* TIM号                 */
    IRQn_Type            irqx;                     /* TIM中断号             */
    TIM_HandleTypeDef   *htimx;                    /* TIM设备句柄           */
};
typedef struct _tim_dev_hal *tim_dev_hal_t;

/*<STRUCT+>********************************************************************/
/* 结构: _TIM_DEV                                                             */
/* 注释: TIM定时器设备                                                       */
/*<STRUCT->********************************************************************/
struct _tim_dev
{
    struct device        tim_dev;                  /* TIM定时器设备           */
    const  char         *tim_name;                 /* TIM定时器名称           */
    tim_dev_hal_t        tim_hal;                  /* TIM定时器句柄           */
    tim_dev_cfg_t        tim_cfg;                  /* TIM定时器参数           */
};
typedef struct _tim_dev *tim_dev_t;

#pragma pack()

/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/


/******************************************************************************/
/*                                 全局函数原型                               */
/******************************************************************************/
int bsp_tim_init(void);


#ifdef __cplusplus
    }
#endif

#endif


