/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 烽鸟出行. 2019. All rights reserved.               */
/*                                                                            */
/* 文件名称: bsp_uart.h                                                       */
/* 内容摘要: 串口驱动初始化头文件                                            */
/* 其它说明: 无                                                               */
/* 当前版本: v 1.0.0                                                          */
/* 作    者: Leonard                                                          */
/* 完成日期: 2020-11-19                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号     修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2020-11-19        v 1.0.0     Leonard         创建文件                 */
/*<FH->************************************************************************/
#ifndef BSP_USART_H
#define BSP_USART_H

/******************************************************************************/
/*               #include(依次为标准库头文件、非标准库头文件)                */
/******************************************************************************/
#include "Fn_mfifo.h"
#include "Fn_device.h"

/******************************************************************************/
/*                              其他条件编译选项                              */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                                  常量定义                                  */
/******************************************************************************/


/******************************************************************************/
/*                                 全局宏定义                                 */
/******************************************************************************/
#define BSP_USE_UART1      
#define BSP_USE_UART2
//#define BSP_USE_UART3
//#define BSP_USE_UART4
//#define BSP_USE_UART5
#define BSP_USE_UART6

/******************************************************************************/
/*                              全局数据类型定义                              */
/******************************************************************************/
#pragma pack(1)

/*<STRUCT+>********************************************************************/
/* 结构: _UART_BUS_CFG                                                        */
/* 注释: UART总线配置参数                                                     */
/*<STRUCT->********************************************************************/
struct _uart_bus_cfg
{
    unsigned int         baud;                    /* 串口默认波特率(可改)   */
    unsigned int         width;                   /* 串口默认数据位宽(可改) */
    unsigned int         parity;                  /* 串口默认校验方式(可改) */
    unsigned int         stop;                    /* 串口默认停止位(可改)   */
    struct _mfifo       *pfifo;                   /* 串口接收环形缓存buff   */
};
typedef struct _uart_bus_cfg *uart_bus_cfg_t;

/*<STRUCT+>********************************************************************/
/* 结构: _UART_BUS_HAL                                                        */
/* 注释: UART总线HAL库句柄                                                    */
/*<STRUCT->********************************************************************/
struct _uart_bus_hal
{
    USART_TypeDef       *uartx;                    /* UART号                */
    IRQn_Type            irqx;                     /* UART中断号            */
    UART_HandleTypeDef  *huartx;                   /* UART设备句柄          */
};
typedef struct _uart_bus_hal *uart_bus_hal_t;

/*<STRUCT+>********************************************************************/
/* 结构: _UART_BUS_DEV                                                        */
/* 注释: UART总线设备                                                         */
/*<STRUCT->********************************************************************/
struct _uart_bus_dev
{
    struct device        uart_dev;                  /* UART总线设备          */
    const  char         *uart_name;                 /* UART总线名称          */
    uart_bus_hal_t       uart_hal;                  /* UART总线句柄          */
    uart_bus_cfg_t       uart_cfg;                  /* UART总线参数          */
};
typedef struct _uart_bus_dev *uart_bus_dev_t;

#pragma pack()

/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/


/******************************************************************************/
/*                                 全局函数原型                               */
/******************************************************************************/
int bsp_uart_init(void);


#ifdef __cplusplus
}
#endif

#endif
