/*<FH+>************************************************************************/
/*                                                                            */
/* 版权所有: Copyright (C) 烽鸟出行. 2019. All rights reserved.               */
/*                                                                            */
/* 文件名称: drv_console.h                                                    */
/* 内容摘要: 控制台驱动源文件                                                */
/* 其它说明: 无                                                               */
/* 当前版本: v 1.0.0                                                          */
/* 作    者: Leonard                                                          */
/* 完成日期: 2020-03-27                                                       */
/* 修改记录:                                                                  */
/*     修改日期          版本号     修改人          修改内容                 */
/* -------------------------------------------------------------------------- */
/*     2020-03-27        v 1.0.0     Leonard         创建文件                 */
/*<FH->************************************************************************/
#ifndef DRV_CONSOLE_H
#define DRV_CONSOLE_H

/******************************************************************************/
/*               #include(依次为标准库头文件、非标准库头文件)                */
/******************************************************************************/
#include "bsp_uart.h"

/******************************************************************************/
/*                              其他条件编译选项                              */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/******************************************************************************/
/*                                  常量定义                                  */
/******************************************************************************/


/******************************************************************************/
/*                                 全局宏定义                                 */
/******************************************************************************/


/******************************************************************************/
/*                              全局数据类型定义                              */
/******************************************************************************/
#pragma pack(1)

/*<STRUCT+>********************************************************************/
/* 结构: _CONSOLE_PARA                                                       */
/* 注释: CONSOLE配置参数结构体                                               */
/*<STRUCT->********************************************************************/
struct _console_para
{
      signed int              fifosz;               /* FIFO数据区总大小    */
    struct _mfifo             fifo;                 /* 接收数据FIFO结构体  */
};
typedef struct _console_para *console_para_t;

/*<STRUCT+>********************************************************************/
/* 结构: CONSOLE_DEVICE                                                      */
/* 注释: CONSOLE设备结构体                                                   */
/*<STRUCT->********************************************************************/
struct console_device
{   
    struct device             dev;                   /* 控制台设备          */
    uart_bus_dev_t            uartx;                 /* UARTx总线设备       */
    struct _console_para      para;                  /* 控制台配置参数      */
#ifdef  BSP_USE_RT_THREAD
    rt_mutex_t                lock;                  /* 控制台设备锁        */
    rt_sem_t                  rx_sem;                /* 控制台通知信号量    */
    rt_sem_t                  tx_sem;
#endif
};
typedef struct console_device *console_device_t;

#pragma pack()

/******************************************************************************/
/*                                全局变量声明                                */
/******************************************************************************/
extern struct console_device *gConsole;

/******************************************************************************/
/*                                 全局函数原型                               */
/******************************************************************************/
int  bsp_console_init(const char *name);
char bsp_console_getc(void);
void bsp_console_putc(const unsigned char c);
void bsp_console_puts(const char *str);
void bsp_console_put(const unsigned char *hex, int len);
int  bsp_console_havec(void);

#ifdef __cplusplus
    }
#endif

#endif

